// general message
"message.error.default" = "An error occurred. Please try again.";
"message.otp.required" = "Please enter OTP";
"message.error.invalid-enter-again" = "Invalid %@.\nPlease enter again.";
"message.cvv.required" = "Please enter CVV/CVC/CVN";
"invalid-authentication" = "Invalid authentication. Please try again.";

// payment method
"payment-method.ewallet" = "Payoo e-Wallet";
"payment-method.international-card" = "International card";
"payment-method.domestic-card" = "Domestic card";
"payment-method.pay@store" = "Pay@Store";
"payment-method.installment" = "Credit card installments";

// placeholder
"place-holder.%@-number-of-digits" = "%@ digits";
"place-holder.card-holder-name" = "No diacritical mark";
"place-holder.card-input.phone" = "Receive support and promotion (if any)";
"place-holder.installment.period" = "Please select period";

// title
"info.title-table.contact" = "CONTACT INFORMATION";
"info.title-table.card" = "CARD INFORMATION";
"info.title-table.payment" = "PAYMENT INFORMATION";

// fields
"fullname" = "Full name";
"issuance-date" = "Issuance date";
"expiry-date" = "Expiry date";
"card-holder-name" = "Card holder name";
"phone" = "Phone number";
"email" = "Email";
"card-type" = "Card type";
"payment" = "Payment";
"fee" = "Fee";
"total" = "Total";
"estimated-amount" = "Estimated amount";
"card-number" = "Card number";
"supported-banks" = "Supported banks";
"payment-code" = "Payment code";
"please-pay-by" = "Please pay by";
"order-no" = "Order No";
"cash-amount" = "Amount";
"order-info-notice" = "You can take note or take the screen photo to save information if you don't receive SMS or email.";
"finding-store-notice" = "After receiving the payment code, please give it to the cashier to pay at the nearest store:";
"account-no" = "Account number";
"cvv" = "CVV/CVC/CVN";
"period" = "Period";

// general button title
"button.title.ok" = "OK";
"button.title.cancel" = "Cancel";
"button.title.close" = "Close";
"button.title.retry" = "Retry";
"button.title.continue" = "Continue";
"button.title.pay" = "Pay";
"button.title.leave" = "Leave";
"button.title.find-store-near-you" = "Find a store near you";

// general alert title
"alert.title.error" = "Error";
"alert.title.confirm" = "Confirm";
"alert.title.success" = "Success";
"alert.title.message" = "Message";

// screen title
"screen.title.payment-method" = "Payment method";
"screen.title.domestic-card-number" = "Card number";
"screen.title.domestic-card-info" = "Card information";
"screen.title.international-card-info" = "Card information";
"screen.title.confirm" = "Confirmation";
"screen.title.select-payment-card" = "Select payment card";
"screen.title.contact-info" = "Contact information";
"screen.title.payment-code" = "Payment Code";

// validate
"validate.invalid.card-number" = "Card number is invalid.";
"validate.invalid.card-number-range" = "Card number has from %@ to %@ digits. Please enter again.";
"validate.invalid.card-number-length" = "Card number has %@ digits. Please enter again.";
"validate.invalid.holder-name" = "Incorrect name. Full name is composed of at most 50 alphabet characters without any special character, diacritical mark and has at least one space in between.";
"validate.date.month-greater-than-12" = "Please enter month from 1 to 12.";
"validate.invalid.phone" = "The mobile number has 10 or 11 digits. Please enter again.";
"validate.invalid.cvv" = "CVV/CVC/CVN has 3 digits printed in the back or front side of the card. Please enter again.";
"validate.invalid-card-info-or-not-support" = "Card information is invalid or the used card is unsupported.";

// payment
"payment.amount-under-min" = "Payment money is below the bank limit.";
"payment.amount-greater-max" = "Payment money is over the bank limit.";
"payment.deposit-times-greater-max-per-day" = "The deposit times are over the allowable limit of the bank.";
"payment.deposit-money-greater-max-per-day" = "Total paid money in a day is over the allowable limit of the bank.";
"payment.wallet-not-activated" = "Your e-Wallet is still not activated. Please check your mail box and activate your e-Wallet.";
"payment.wallet-locked" = "Your e-Wallet is temporarily locked. Please contact Customer Support for more information.";
"payment.wallet-locked-forever" = "Your e-Wallet is locked. Please contact Customer Support for more information.";
"payment.invalid-card-number" = "Card number is invalid. Please enter again.";
"payment.invalid-card-name" = "Card name is invalid. Please enter again.";
"payment.invalid-card-issuance-date" = "Issuance date is invalid. Please enter again.";
"payment.invalid-card-expiry-date" = "Expiry date is invalid. Please enter again.";
"payment.invalid-account" = "Bank account is invalid. Please enter again.";
"payment.expired-token" = "Your session has been expired. Please do it again.";
"payment.locked-card" = "Your card is expired or locked. Please contact issuer bank to get support.";
"payment.locked-account" = "Your account is locked. Please contact issuer bank to get support.";
"payment.card-not-registered" = "Your card is not registered (or not supported) for online transaction. Please contact issuer bank to get support.";
"payment.limited-payment" = "Your card/account does not have enough fund or exceed payment limit.";
"payment.money-not-enough" = "Your card/account does not have enough fund or exceed payment limit.";
"payment.invalid-card-info" = "Card information is not correct. Please check again.";
"payment.payment-fee-null" = "Service provider does not allow payment with transaction fee. Please use other payment methods.";
"payment.card-transtype-out-limit" = "Credit limit of card %@ is not enough to make payment (%@/%@).";
"payment.device-transtype-out-limit" = "Credit limit of this device is not enough to make payment (%@/%@).";
"payment.card-out-limit-app" = "Credit limit of card %@ is not enough to make payment (%@/%@).";
"payment.device-out-limit-app" = "Credit limit of this device is not enough to make payment (%@/%@).";
"payment.card-out-limit" = "Credit limit of card %@ is not enough to make payment (%@/%@).";
"payment.device-out-limit" = "Credit limit of this device is not enough to make payment for transaction (%@/%@).";
"payment.installment.%@-bank.amount-under-%@-min" = "To apply instalment plan of %@, the order amount must be at least %@";
"payment.installment.%@-bank.amount-greater-%@-max" = "To apply instalment plan of %@, the order amount must not be over %@";

// otp
"otp.invalid-repay" = "The OTP password input is not correct or expired. Please try again.";

// webview
"webview.close.confirm" = "Incomplete transaction. Are you sure you want exit?";

// select payment card
"payment-card.other-method" = "Other payment method";

"payment-method.title.select-bank" = "Select bank";

// save card option view
"label.save-card.description" = "Save card information for next payments.";

"payment-token.remove.confirm" = "Do you want to remove this card?";
"payment-token.remove.success" = "Remove card successfullly!";
